bool nums[10][8] = { // - массив цифр для дислея(от 0 до 9)            
 // A, B, C, D, E, F, G, DP  - Форма записи для дисплея
   {1, 1, 1, 1, 1, 1, 0, 0}, //0                A 
   {0, 1, 1, 0, 0, 0, 0, 0}, //1             F     B
   {1, 1, 0, 1, 1, 0, 1, 0}, //2                G
   {1, 1, 1, 1, 0, 0, 1, 0}, //3             E     C
   {0, 1, 1, 0, 0, 1, 1, 0}, //4                D
   {1, 0, 1, 1, 0, 1, 1, 0}, //5                   DP
   {1, 0, 1, 1, 1, 1, 1, 1}, //6                          
   {1, 1, 1, 0, 0, 0, 0, 0}, //7
   {1, 1, 1, 1, 1, 1, 1, 0}, //8
   {1, 1, 1, 1, 0, 1, 1, 1}  //9
};

void setup() {
    //Отключение всех светодиодов при включении
  for ( int pin = 2; pin <= 9; pin++){
    pinMode(pin, OUTPUT);
    digitalWrite(pin, LOW);
  }
}

void loop() {
    //Цикл для включения светодиодов
  for(byte digit = 0; digit <= 9; digit++){
    for(byte num = 0; num < 8; num++){
      if (nums[digit][num] == 0) digitalWrite(num + 2, LOW);
        else digitalWrite(num + 2, HIGH);
    }  delay(500); //Задежка между цифрами (мс)
  }
}
